In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
cancellations = pd.read_csv('Client_Cancellations.csv')
bookings = pd.read_csv('Future_Bookings_All_Clients.csv')

In [3]:
cancellations.head()

  Cancel Date    Code Service   Staff Booking Date Canceled By  Days
0  05/22/2018  MASA01     CFC  JOANNE   05/24/2018       ADMIN   2.0
1  06/27/2018  MASA01    CBAL   KELLY   06/27/2018       ADMIN   0.0
2  07/03/2018  MASA01    SHCM   BECKY   07/10/2018       BECKY   7.0
3  07/10/2018  MASA01    SHCC      JJ   07/11/2018       KELLY   1.0
4  07/24/2018  TRUA01    SHCM   KELLY   07/24/2018       TANYA   0.0

In [10]:
cancellations.tail()

    Cancel Date    Code Service   Staff Booking Date Canceled By  Days
238  05/06/2018  ROUT01     SBD      JJ   05/06/2018          JJ   0.0
239  06/07/2018  ALCV01     CFC   KELLY   06/07/2018       KELLY   0.0
240  06/26/2018  FISV01     CFC  JOANNE   06/30/2018          JJ   4.0
241  05/04/2018  MCGV01     SBD   BECKY   05/04/2018          JJ   0.0
242  05/18/2018  MIRY01    CDPB  JOANNE   05/19/2018      JOANNE   1.0

In [5]:
bookings.head()

     Code Staff Service        Date         Time  TimeInt
0  JUNJ01    JJ     CON  03/14/2018   3:50:00 PM      950
1  NORJ01    JJ    SHCM  03/14/2018   4:00:00 PM      960
2  CORS01    JJ    SHCW  03/15/2018   2:10:00 PM      850
3  KERT01    JJ    SHCW  03/15/2018  10:00:00 AM      600
4  LEHJ01    JJ    SHCM  03/15/2018   6:00:00 PM     1080

In [8]:
bookings.tail()

        Code Staff Service        Date         Time  TimeInt
1901  KOOM01    JJ    SHCW  11/23/2018  11:00:00 AM      660
1902  SLUS01    JJ    SHCM  12/05/2018  11:10:00 AM      670
1903  CHEW01    JJ    SHCW  12/21/2018  10:00:00 AM      600
1904  KOOM01    JJ    SHCW  01/04/2019  11:00:00 AM      660
1905  KOOM01    JJ    SHCW  02/15/2019  11:00:00 AM      660

In [6]:
all_bookings = pd.concat([cancellations, bookings])

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [7]:
all_bookings.head()

,Booking Date,Cancel Date,Canceled By,Code,Date,Days,Service,Staff,Time,TimeInt
0,05/24/2018,05/22/2018,ADMIN,MASA01,NaN,2.0,CFC,JOANNE,NaN,NaN
1,06/27/2018,06/27/2018,ADMIN,MASA01,NaN,0.0,CBAL,KELLY,NaN,NaN
2,07/10/2018,07/03/2018,BECKY,MASA01,NaN,7.0,SHCM,BECKY,NaN,NaN
3,07/11/2018,07/10/2018,KELLY,MASA01,NaN,1.0,SHCC,JJ,NaN,NaN
4,07/24/2018,07/24/2018,TANYA,TRUA01,NaN,0.0,SHCM,KELLY,NaN,NaN

In [9]:
all_bookings.tail()

,Booking Date,Cancel Date,Canceled By,Code,Date,Days,Service,Staff,Time,TimeInt
1901,NaN,NaN,NaN,KOOM01,11/23/2018,NaN,SHCW,JJ,11:00:00 AM,660.0
1902,NaN,NaN,NaN,SLUS01,12/05/2018,NaN,SHCM,JJ,11:10:00 AM,670.0
1903,NaN,NaN,NaN,CHEW01,12/21/2018,NaN,SHCW,JJ,10:00:00 AM,600.0
1904,NaN,NaN,NaN,KOOM01,01/04/2019,NaN,SHCW,JJ,11:00:00 AM,660.0
1905,NaN,NaN,NaN,KOOM01,02/15/2019,NaN,SHCW,JJ,11:00:00 AM,660.0

In [11]:
all_bookings.iloc[240:250, :]

,Booking Date,Cancel Date,Canceled By,Code,Date,Days,Service,Staff,Time,TimeInt
240,06/30/2018,06/26/2018,JJ,FISV01,NaN,4.0,CFC,JOANNE,NaN,NaN
241,05/04/2018,05/04/2018,JJ,MCGV01,NaN,0.0,SBD,BECKY,NaN,NaN
242,05/19/2018,05/18/2018,JOANNE,MIRY01,NaN,1.0,CDPB,JOANNE,NaN,NaN
0,NaN,NaN,NaN,JUNJ01,03/14/2018,NaN,CON,JJ,3:50:00 PM,950.0
1,NaN,NaN,NaN,NORJ01,03/14/2018,NaN,SHCM,JJ,4:00:00 PM,960.0
2,NaN,NaN,NaN,CORS01,03/15/2018,NaN,SHCW,JJ,2:10:00 PM,850.0
3,NaN,NaN,NaN,KERT01,03/15/2018,NaN,SHCW,JJ,10:00:00 AM,600.0
4,NaN,NaN,NaN,LEHJ01,03/15/2018,NaN,SHCM,JJ,6:00:00 PM,1080.0
5,NaN,NaN,NaN,SCHJ01,03/15/2018,NaN,SHCM,JJ,12:00:00 PM,720.0
6,NaN,NaN,NaN,SCHJ01,03/15/2018,NaN,CCAMO,JJ,12:50:00 PM,770.0

In [12]:
all_bookings = all_bookings.reset_index()

In [13]:
all_bookings.tail()

,index,Booking Date,Cancel Date,Canceled By,Code,Date,Days,Service,Staff,Time,TimeInt
2144,1901,NaN,NaN,NaN,KOOM01,11/23/2018,NaN,SHCW,JJ,11:00:00 AM,660.0
2145,1902,NaN,NaN,NaN,SLUS01,12/05/2018,NaN,SHCM,JJ,11:10:00 AM,670.0
2146,1903,NaN,NaN,NaN,CHEW01,12/21/2018,NaN,SHCW,JJ,10:00:00 AM,600.0
2147,1904,NaN,NaN,NaN,KOOM01,01/04/2019,NaN,SHCW,JJ,11:00:00 AM,660.0
2148,1905,NaN,NaN,NaN,KOOM01,02/15/2019,NaN,SHCW,JJ,11:00:00 AM,660.0